Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.7.228/edc/ATSAME53N20A.PIC
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSC" edc:nzwidth="0x20" edc:access="-----------------rrrrrrrrrrrrr--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFC" edc:_addr="0x4000003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GMAC_" edc:nzwidth="0x1" edc:desc="GMAC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:nzwidth="0x1" edc:desc="TCC2 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TCC3_" edc:nzwidth="0x1" edc:desc="TCC3 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:nzwidth="0x1" edc:desc="TC4 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:nzwidth="0x1" edc:desc="TC5 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PDEC_" edc:nzwidth="0x1" edc:desc="PDEC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="AES_" edc:nzwidth="0x1" edc:desc="AES APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="ICM_" edc:nzwidth="0x1" edc:desc="ICM APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PUKCC_" edc:nzwidth="0x1" edc:desc="PUKCC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="QSPI_" edc:nzwidth="0x1" edc:desc="QSPI APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSD" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x40000040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:nzwidth="0x1" edc:desc="SERCOM4 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:nzwidth="0x1" edc:desc="SERCOM5 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM6_" edc:nzwidth="0x1" edc:desc="SERCOM6 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM7_" edc:nzwidth="0x1" edc:desc="SERCOM7 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TCC4_" edc:nzwidth="0x1" edc:desc="TCC4 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC6_" edc:nzwidth="0x1" edc:desc="TC6 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC7_" edc:nzwidth="0x1" edc:desc="TC7 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:nzwidth="0x1" edc:desc="ADC0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="ADC1_" edc:nzwidth="0x1" edc:desc="ADC1 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="I2S_" edc:nzwidth="0x1" edc:desc="I2S APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PCC_" edc:nzwidth="0x1" edc:desc="PCC APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3BC" edc:_addr="0x40000044"/>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-----n--" edc:por="00000000" edc:mclr="00000000" edc:impl="0x4" edc:_addr="0x40000400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="IORET" edc:nzwidth="0x1" edc:desc="I/O Retention"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="SLEEPCFG" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000010" edc:mclr="00000010" edc:impl="0x7" edc:_addr="0x40000401">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="SLEEPMODE" edc:nzwidth="0x3" edc:desc="Sleep Mode">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="CPU, AHBx, and APBx clocks are OFF" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="STANDBY" edc:desc="All Clocks are OFF" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="HIBERNATE" edc:desc="Backup domain is ON as well as some PDRAMs" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="BACKUP" edc:desc="Only Backup domain is powered ON" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="All power domains are powered OFF" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x40000402"/>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="SLEEPRDY" edc:nzwidth="0x1" edc:desc="Sleep Mode Entry Ready Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000405">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="SLEEPRDY" edc:nzwidth="0x1" edc:desc="Sleep Mode Entry Ready Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000406">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="SLEEPRDY" edc:nzwidth="0x1" edc:desc="Sleep Mode Entry Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x40000407"/>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="STDBYCFG" edc:nzwidth="0x8" edc:access="--nn--nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x33" edc:_addr="0x40000408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="RAMCFG" edc:nzwidth="0x2" edc:desc="Ram Configuration">
              <edc:SFRFieldSemantic edc:cname="RET" edc:desc="All the system RAM is retained" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PARTIAL" edc:desc="Only the first 32Kbytes of the system RAM is retained" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="All the system RAM is turned OFF" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FASTWKUP" edc:nzwidth="0x2" edc:desc="Fast Wakeup">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Fast Wakeup is disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NVM" edc:desc="Fast Wakeup is enabled on NVM" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MAINVREG" edc:desc="Fast Wakeup is enabled on the main voltage regulator (MAINVREG)" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Fast Wakeup is enabled on both NVM and MAINVREG" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="HIBCFG" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x40000409">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="RAMCFG" edc:nzwidth="0x2" edc:desc="Ram Configuration">
              <edc:SFRFieldSemantic edc:cname="RET" edc:desc="All the system RAM is retained" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PARTIAL" edc:desc="Only the first 32Kbytes of the system RAM is retained" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="All the system RAM is turned OFF" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRAMCFG" edc:nzwidth="0x2" edc:desc="Backup Ram Configuration">
              <edc:SFRFieldSemantic edc:cname="RET" edc:desc="All the backup RAM is retained" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PARTIAL" edc:desc="Only the first 4Kbytes of the backup RAM is retained" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="All the backup RAM is turned OFF" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="BKUPCFG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4000040A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="BRAMCFG" edc:nzwidth="0x2" edc:desc="Ram Configuration">
              <edc:SFRFieldSemantic edc:cname="RET" edc:desc="All the backup RAM is retained" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PARTIAL" edc:desc="Only the first 4Kbytes of the backup RAM is retained" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="All the backup RAM is turned OFF" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
