Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.7.228/edc/ATSAME53N20A.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4100A022"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="INTSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CHINT0" edc:nzwidth="0x1" edc:desc="Channel 0 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT1" edc:nzwidth="0x1" edc:desc="Channel 1 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT2" edc:nzwidth="0x1" edc:desc="Channel 2 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT3" edc:nzwidth="0x1" edc:desc="Channel 3 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT4" edc:nzwidth="0x1" edc:desc="Channel 4 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT5" edc:nzwidth="0x1" edc:desc="Channel 5 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT6" edc:nzwidth="0x1" edc:desc="Channel 6 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT7" edc:nzwidth="0x1" edc:desc="Channel 7 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT8" edc:nzwidth="0x1" edc:desc="Channel 8 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT9" edc:nzwidth="0x1" edc:desc="Channel 9 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT10" edc:nzwidth="0x1" edc:desc="Channel 10 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT11" edc:nzwidth="0x1" edc:desc="Channel 11 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT12" edc:nzwidth="0x1" edc:desc="Channel 12 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT13" edc:nzwidth="0x1" edc:desc="Channel 13 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT14" edc:nzwidth="0x1" edc:desc="Channel 14 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT15" edc:nzwidth="0x1" edc:desc="Channel 15 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT16" edc:nzwidth="0x1" edc:desc="Channel 16 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT17" edc:nzwidth="0x1" edc:desc="Channel 17 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT18" edc:nzwidth="0x1" edc:desc="Channel 18 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT19" edc:nzwidth="0x1" edc:desc="Channel 19 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT20" edc:nzwidth="0x1" edc:desc="Channel 20 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT21" edc:nzwidth="0x1" edc:desc="Channel 21 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT22" edc:nzwidth="0x1" edc:desc="Channel 22 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT23" edc:nzwidth="0x1" edc:desc="Channel 23 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT24" edc:nzwidth="0x1" edc:desc="Channel 24 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT25" edc:nzwidth="0x1" edc:desc="Channel 25 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT26" edc:nzwidth="0x1" edc:desc="Channel 26 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT27" edc:nzwidth="0x1" edc:desc="Channel 27 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT28" edc:nzwidth="0x1" edc:desc="Channel 28 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT29" edc:nzwidth="0x1" edc:desc="Channel 29 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT30" edc:nzwidth="0x1" edc:desc="Channel 30 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT31" edc:nzwidth="0x1" edc:desc="Channel 31 Pending Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="BUSYCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BUSYCH0" edc:nzwidth="0x1" edc:desc="Busy Channel 0"/>
            <edc:SFRFieldDef edc:cname="BUSYCH1" edc:nzwidth="0x1" edc:desc="Busy Channel 1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH2" edc:nzwidth="0x1" edc:desc="Busy Channel 2"/>
            <edc:SFRFieldDef edc:cname="BUSYCH3" edc:nzwidth="0x1" edc:desc="Busy Channel 3"/>
            <edc:SFRFieldDef edc:cname="BUSYCH4" edc:nzwidth="0x1" edc:desc="Busy Channel 4"/>
            <edc:SFRFieldDef edc:cname="BUSYCH5" edc:nzwidth="0x1" edc:desc="Busy Channel 5"/>
            <edc:SFRFieldDef edc:cname="BUSYCH6" edc:nzwidth="0x1" edc:desc="Busy Channel 6"/>
            <edc:SFRFieldDef edc:cname="BUSYCH7" edc:nzwidth="0x1" edc:desc="Busy Channel 7"/>
            <edc:SFRFieldDef edc:cname="BUSYCH8" edc:nzwidth="0x1" edc:desc="Busy Channel 8"/>
            <edc:SFRFieldDef edc:cname="BUSYCH9" edc:nzwidth="0x1" edc:desc="Busy Channel 9"/>
            <edc:SFRFieldDef edc:cname="BUSYCH10" edc:nzwidth="0x1" edc:desc="Busy Channel 10"/>
            <edc:SFRFieldDef edc:cname="BUSYCH11" edc:nzwidth="0x1" edc:desc="Busy Channel 11"/>
            <edc:SFRFieldDef edc:cname="BUSYCH12" edc:nzwidth="0x1" edc:desc="Busy Channel 12"/>
            <edc:SFRFieldDef edc:cname="BUSYCH13" edc:nzwidth="0x1" edc:desc="Busy Channel 13"/>
            <edc:SFRFieldDef edc:cname="BUSYCH14" edc:nzwidth="0x1" edc:desc="Busy Channel 14"/>
            <edc:SFRFieldDef edc:cname="BUSYCH15" edc:nzwidth="0x1" edc:desc="Busy Channel 15"/>
            <edc:SFRFieldDef edc:cname="BUSYCH16" edc:nzwidth="0x1" edc:desc="Busy Channel 16"/>
            <edc:SFRFieldDef edc:cname="BUSYCH17" edc:nzwidth="0x1" edc:desc="Busy Channel 17"/>
            <edc:SFRFieldDef edc:cname="BUSYCH18" edc:nzwidth="0x1" edc:desc="Busy Channel 18"/>
            <edc:SFRFieldDef edc:cname="BUSYCH19" edc:nzwidth="0x1" edc:desc="Busy Channel 19"/>
            <edc:SFRFieldDef edc:cname="BUSYCH20" edc:nzwidth="0x1" edc:desc="Busy Channel 20"/>
            <edc:SFRFieldDef edc:cname="BUSYCH21" edc:nzwidth="0x1" edc:desc="Busy Channel 21"/>
            <edc:SFRFieldDef edc:cname="BUSYCH22" edc:nzwidth="0x1" edc:desc="Busy Channel 22"/>
            <edc:SFRFieldDef edc:cname="BUSYCH23" edc:nzwidth="0x1" edc:desc="Busy Channel 23"/>
            <edc:SFRFieldDef edc:cname="BUSYCH24" edc:nzwidth="0x1" edc:desc="Busy Channel 24"/>
            <edc:SFRFieldDef edc:cname="BUSYCH25" edc:nzwidth="0x1" edc:desc="Busy Channel 25"/>
            <edc:SFRFieldDef edc:cname="BUSYCH26" edc:nzwidth="0x1" edc:desc="Busy Channel 26"/>
            <edc:SFRFieldDef edc:cname="BUSYCH27" edc:nzwidth="0x1" edc:desc="Busy Channel 27"/>
            <edc:SFRFieldDef edc:cname="BUSYCH28" edc:nzwidth="0x1" edc:desc="Busy Channel 28"/>
            <edc:SFRFieldDef edc:cname="BUSYCH29" edc:nzwidth="0x1" edc:desc="Busy Channel 29"/>
            <edc:SFRFieldDef edc:cname="BUSYCH30" edc:nzwidth="0x1" edc:desc="Busy Channel 30"/>
            <edc:SFRFieldDef edc:cname="BUSYCH31" edc:nzwidth="0x1" edc:desc="Busy Channel 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="PENDCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:nzwidth="0x1" edc:desc="Pending Channel 0"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:nzwidth="0x1" edc:desc="Pending Channel 1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:nzwidth="0x1" edc:desc="Pending Channel 2"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:nzwidth="0x1" edc:desc="Pending Channel 3"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:nzwidth="0x1" edc:desc="Pending Channel 4"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:nzwidth="0x1" edc:desc="Pending Channel 5"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:nzwidth="0x1" edc:desc="Pending Channel 6"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:nzwidth="0x1" edc:desc="Pending Channel 7"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:nzwidth="0x1" edc:desc="Pending Channel 8"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:nzwidth="0x1" edc:desc="Pending Channel 9"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:nzwidth="0x1" edc:desc="Pending Channel 10"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:nzwidth="0x1" edc:desc="Pending Channel 11"/>
            <edc:SFRFieldDef edc:cname="PENDCH12" edc:nzwidth="0x1" edc:desc="Pending Channel 12"/>
            <edc:SFRFieldDef edc:cname="PENDCH13" edc:nzwidth="0x1" edc:desc="Pending Channel 13"/>
            <edc:SFRFieldDef edc:cname="PENDCH14" edc:nzwidth="0x1" edc:desc="Pending Channel 14"/>
            <edc:SFRFieldDef edc:cname="PENDCH15" edc:nzwidth="0x1" edc:desc="Pending Channel 15"/>
            <edc:SFRFieldDef edc:cname="PENDCH16" edc:nzwidth="0x1" edc:desc="Pending Channel 16"/>
            <edc:SFRFieldDef edc:cname="PENDCH17" edc:nzwidth="0x1" edc:desc="Pending Channel 17"/>
            <edc:SFRFieldDef edc:cname="PENDCH18" edc:nzwidth="0x1" edc:desc="Pending Channel 18"/>
            <edc:SFRFieldDef edc:cname="PENDCH19" edc:nzwidth="0x1" edc:desc="Pending Channel 19"/>
            <edc:SFRFieldDef edc:cname="PENDCH20" edc:nzwidth="0x1" edc:desc="Pending Channel 20"/>
            <edc:SFRFieldDef edc:cname="PENDCH21" edc:nzwidth="0x1" edc:desc="Pending Channel 21"/>
            <edc:SFRFieldDef edc:cname="PENDCH22" edc:nzwidth="0x1" edc:desc="Pending Channel 22"/>
            <edc:SFRFieldDef edc:cname="PENDCH23" edc:nzwidth="0x1" edc:desc="Pending Channel 23"/>
            <edc:SFRFieldDef edc:cname="PENDCH24" edc:nzwidth="0x1" edc:desc="Pending Channel 24"/>
            <edc:SFRFieldDef edc:cname="PENDCH25" edc:nzwidth="0x1" edc:desc="Pending Channel 25"/>
            <edc:SFRFieldDef edc:cname="PENDCH26" edc:nzwidth="0x1" edc:desc="Pending Channel 26"/>
            <edc:SFRFieldDef edc:cname="PENDCH27" edc:nzwidth="0x1" edc:desc="Pending Channel 27"/>
            <edc:SFRFieldDef edc:cname="PENDCH28" edc:nzwidth="0x1" edc:desc="Pending Channel 28"/>
            <edc:SFRFieldDef edc:cname="PENDCH29" edc:nzwidth="0x1" edc:desc="Pending Channel 29"/>
            <edc:SFRFieldDef edc:cname="PENDCH30" edc:nzwidth="0x1" edc:desc="Pending Channel 30"/>
            <edc:SFRFieldDef edc:cname="PENDCH31" edc:nzwidth="0x1" edc:desc="Pending Channel 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
