Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.7.228/edc/ATSAME53N20A.PIC
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="--nn--nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x33" edc:_addr="0x4101C00A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="OVF Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="ERR Interrupt Flag"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:nzwidth="0x1" edc:desc="MC Interrupt Flag 0"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:nzwidth="0x1" edc:desc="MC Interrupt Flag 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="--nnn-nn" edc:por="00000001" edc:mclr="00000001" edc:impl="0x3B" edc:_addr="0x4101C00B">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="STOP" edc:nzwidth="0x1" edc:desc="Stop Status Flag"/>
            <edc:SFRFieldDef edc:cname="SLAVE" edc:nzwidth="0x1" edc:desc="Slave Status Flag"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERBUFV" edc:nzwidth="0x1" edc:desc="Synchronization Busy Status"/>
            <edc:SFRFieldDef edc:cname="CCBUFV0" edc:nzwidth="0x1" edc:desc="Compare channel buffer 0 valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV1" edc:nzwidth="0x1" edc:desc="Compare channel buffer 1 valid"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="WAVE" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4101C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:nzwidth="0x2" edc:desc="Waveform Generation Mode">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:desc="Normal frequency" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:desc="Match frequency" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:desc="Normal PWM" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MPWM" edc:desc="Match PWM" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="DRVCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4101C00D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="INVEN0" edc:nzwidth="0x1" edc:desc="Output Waveform Invert Enable 0"/>
            <edc:SFRFieldDef edc:cname="INVEN1" edc:nzwidth="0x1" edc:desc="Output Waveform Invert Enable 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x4101C00E"/>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x4101C00F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Run During Debug"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x4101C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="swrst"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="enable"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="CTRLB"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:nzwidth="0x1" edc:desc="STATUS"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x1" edc:desc="Counter"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x1" edc:desc="Period"/>
            <edc:SFRFieldDef edc:cname="CC0" edc:nzwidth="0x1" edc:desc="Compare Channel 0"/>
            <edc:SFRFieldDef edc:cname="CC1" edc:nzwidth="0x1" edc:desc="Compare Channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FEC" edc:_addr="0x4101C014"/>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41020000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="SINGLEE" edc:nzwidth="0x1" edc:desc="Single Bit ECC Error Interrupt Enable Clear"/>
            <edc:SFRFieldDef edc:cname="DUALE" edc:nzwidth="0x1" edc:desc="Dual Bit ECC Error Interrupt Enable Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41020001">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="SINGLEE" edc:nzwidth="0x1" edc:desc="Single Bit ECC Error Interrupt Enable Set"/>
            <edc:SFRFieldDef edc:cname="DUALE" edc:nzwidth="0x1" edc:desc="Dual Bit ECC Error Interrupt Enable Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41020002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="SINGLEE" edc:nzwidth="0x1" edc:desc="Single Bit ECC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="DUALE" edc:nzwidth="0x1" edc:desc="Dual Bit ECC Error Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="-------r" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x41020003">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:nzwidth="0x1" edc:desc="ECC Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="ERRADDR" edc:nzwidth="0x20" edc:access="---------------rrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFFF" edc:_addr="0x41020004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ERRADDR" edc:nzwidth="0x11" edc:desc="Error Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7" edc:_addr="0x41020008"/>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4102000F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:nzwidth="0x1" edc:desc="ECC Disable"/>
            <edc:SFRFieldDef edc:cname="ECCELOG" edc:nzwidth="0x1" edc:desc="ECC Error Log"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="HPB2" edc:beginaddr="0x42000000" edc:endaddr="0x42003818" edc:rw="rw">
      <edc:AdjustPoint edc:offset="0x800" edc:_addr="0x42000000"/>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="NCR" edc:nzwidth="0x20" edc:access="------------nnnnn--nnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF9FFE" edc:_addr="0x42000800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBL" edc:nzwidth="0x1" edc:desc="Loop Back Local"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receive Enable"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmit Enable"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Management Port Enable"/>
            <edc:SFRFieldDef edc:cname="CLRSTAT" edc:nzwidth="0x1" edc:desc="Clear Statistics Registers"/>
            <edc:SFRFieldDef edc:cname="INCSTAT" edc:nzwidth="0x1" edc:desc="Increment Statistics Registers"/>
            <edc:SFRFieldDef edc:cname="WESTAT" edc:nzwidth="0x1" edc:desc="Write Enable for Statistics Registers"/>
            <edc:SFRFieldDef edc:cname="BP" edc:nzwidth="0x1" edc:desc="Back pressure"/>
            <edc:SFRFieldDef edc:cname="TSTART" edc:nzwidth="0x1" edc:desc="Start Transmission"/>
            <edc:SFRFieldDef edc:cname="THALT" edc:nzwidth="0x1" edc:desc="Transmit Halt"/>
            <edc:SFRFieldDef edc:cname="TXPF" edc:nzwidth="0x1" edc:desc="Transmit Pause Frame"/>
            <edc:SFRFieldDef edc:cname="TXZQPF" edc:nzwidth="0x1" edc:desc="Transmit Zero Quantum Pause Frame"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRTSM" edc:nzwidth="0x1" edc:desc="Store Receive Time Stamp to Memory"/>
            <edc:SFRFieldDef edc:cname="ENPBPR" edc:nzwidth="0x1" edc:desc="Enable PFC Priority-based Pause Reception"/>
            <edc:SFRFieldDef edc:cname="TXPBPF" edc:nzwidth="0x1" edc:desc="Transmit PFC Priority-based Pause Frame"/>
            <edc:SFRFieldDef edc:cname="FNP" edc:nzwidth="0x1" edc:desc="Flush Next Packet"/>
            <edc:SFRFieldDef edc:cname="LPI" edc:nzwidth="0x1" edc:desc="Low Power Idle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
