Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.7.228/edc/ATSAME53N20A.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4500004C"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="FERACES" edc:nzwidth="0x10" edc:access="--------w--wwwww" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x9F" edc:_addr="0x45000050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="ACMD12NE" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD12 Not Executed">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDTEO" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDCRC" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDEND" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDIDX" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD Index Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMDNI" edc:nzwidth="0x1" edc:desc="Force Event for Command Not Issued By Auto CMD12 Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="FEREIS" edc:nzwidth="0x10" edc:access="---w--wwwwwwwwww" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x13FF" edc:_addr="0x45000052">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="CMDTEO" edc:nzwidth="0x1" edc:desc="Force Event for Command Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDCRC" edc:nzwidth="0x1" edc:desc="Force Event for Command CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDEND" edc:nzwidth="0x1" edc:desc="Force Event for Command End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:nzwidth="0x1" edc:desc="Force Event for Command Index Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATTEO" edc:nzwidth="0x1" edc:desc="Force Event for Data Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATCRC" edc:nzwidth="0x1" edc:desc="Force Event for Data CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATEND" edc:nzwidth="0x1" edc:desc="Force Event for Data End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURLIM" edc:nzwidth="0x1" edc:desc="Force Event for Current Limit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMD" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA" edc:nzwidth="0x1" edc:desc="Force Event for ADMA Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTAE" edc:nzwidth="0x1" edc:desc="Force Event for Boot Acknowledge Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="AESR" edc:nzwidth="0x8" edc:access="-----rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x45000054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="ERRST" edc:nzwidth="0x2" edc:desc="ADMA Error State">
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="ST_STOP (Stop DMA)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FDS" edc:desc="ST_FDS (Fetch Descriptor)" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TFR" edc:desc="ST_TFR (Transfer Data)" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LMIS" edc:nzwidth="0x1" edc:desc="ADMA Length Mismatch Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x45000055"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="ASAR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x45000058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="ADMASA" edc:nzwidth="0x20" edc:desc="ADMA System Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
