Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.7.228/edc/ATSAME53N20A.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4600005C"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR0" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR1" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000062">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR2" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR3" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000066">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR4" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR5" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x4600006A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR6" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x4600006C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR7" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x4600006E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8C" edc:_addr="0x46000070"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="SISR" edc:nzwidth="0x10" edc:access="--------------rr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3" edc:_addr="0x460000FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="INTSSL" edc:nzwidth="0x2" edc:desc="Interrupt Signal for Each SDHC Slot"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="HCVR" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:por="0001100000000010" edc:mclr="0001100000000010" edc:_addr="0x460000FE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SVER" edc:nzwidth="0x8" edc:desc="Spec Version"/>
            <edc:SFRFieldDef edc:cname="VVER" edc:nzwidth="0x8" edc:desc="Vendor Version"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x100" edc:_addr="0x46000100"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="APSR" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:por="00000000000000000000000000001111" edc:mclr="00000000000000000000000000001111" edc:impl="0xF" edc:_addr="0x46000200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="HDATLL" edc:nzwidth="0x4" edc:desc="High Line Level"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
