Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.7.228/edc/ATSAME53N20A.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------rrrrr------rrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF81FF" edc:addr="0x40002410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Bit Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Bit Busy"/>
            <edc:SFRFieldDef edc:cname="FREQCORR" edc:nzwidth="0x1" edc:desc="FREQCORR Register Busy"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x1" edc:desc="COUNT Register Busy"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x1" edc:desc="PER Register Busy"/>
            <edc:SFRFieldDef edc:cname="COMP0" edc:nzwidth="0x1" edc:desc="COMP 0 Register Busy"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:nzwidth="0x1" edc:desc="COMP 1 Register Busy"/>
            <edc:SFRFieldDef edc:cname="COMP2" edc:nzwidth="0x1" edc:desc="COMP 2 Register Busy"/>
            <edc:SFRFieldDef edc:cname="COMP3" edc:nzwidth="0x1" edc:desc="COMP 3 Register Busy"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="COUNTSYNC" edc:nzwidth="0x1" edc:desc="Count Synchronization Enable Bit Busy"/>
            <edc:SFRFieldDef edc:cname="GP0" edc:nzwidth="0x1" edc:desc="General Purpose 0 Register Busy"/>
            <edc:SFRFieldDef edc:cname="GP1" edc:nzwidth="0x1" edc:desc="General Purpose 1 Register Busy"/>
            <edc:SFRFieldDef edc:cname="GP2" edc:nzwidth="0x1" edc:desc="General Purpose 2 Register Busy"/>
            <edc:SFRFieldDef edc:cname="GP3" edc:nzwidth="0x1" edc:desc="General Purpose 3 Register Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="COUNT" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x40002418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x10" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="PER" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x4000241C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x10" edc:desc="Counter Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="COMP0" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x40002420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COMP" edc:nzwidth="0x10" edc:desc="Compare Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="COMP1" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x40002422">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COMP" edc:nzwidth="0x10" edc:desc="Compare Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="COMP2" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x40002424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COMP" edc:nzwidth="0x10" edc:desc="Compare Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="COMP3" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x40002426">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COMP" edc:nzwidth="0x10" edc:desc="Compare Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="TIMESTAMP" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:addr="0x40002464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x10" edc:desc="Count Timestamp Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="RTC/MODE2">
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="CTRLA" edc:nzwidth="0x10" edc:access="nnn-nnnnnn--nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xEFCF" edc:addr="0x40002400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x2" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Mode 0: 32-bit Counter" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Mode 1: 16-bit Counter" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLOCK" edc:desc="Mode 2: Clock/Calendar" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLKREP" edc:nzwidth="0x1" edc:desc="Clock Representation"/>
            <edc:SFRFieldDef edc:cname="MATCHCLR" edc:nzwidth="0x1" edc:desc="Clear on Match"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x4" edc:desc="Prescaler">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_CNT = GCLK_RTC/2" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_CNT = GCLK_RTC/4" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_CNT = GCLK_RTC/8" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_CNT = GCLK_RTC/16" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_CNT = GCLK_RTC/32" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_CNT = GCLK_RTC/64" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_CNT = GCLK_RTC/128" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_CNT = GCLK_RTC/256" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="CLK_RTC_CNT = GCLK_RTC/512" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="CLK_RTC_CNT = GCLK_RTC/1024" edc:when="(field &amp; 0xF) == 0x0B"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BKTRST" edc:nzwidth="0x1" edc:desc="BKUP Registers Reset On Tamper Enable"/>
            <edc:SFRFieldDef edc:cname="GPTRST" edc:nzwidth="0x1" edc:desc="GP Registers Reset On Tamper Enable"/>
            <edc:SFRFieldDef edc:cname="CLOCKSYNC" edc:nzwidth="0x1" edc:desc="Clock Read Synchronization Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="CTRLB" edc:nzwidth="0x10" edc:access="-nnn-nnnnnnn--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x77F3" edc:addr="0x40002402">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="GP0EN" edc:nzwidth="0x1" edc:desc="General Purpose 0 Enable"/>
            <edc:SFRFieldDef edc:cname="GP2EN" edc:nzwidth="0x1" edc:desc="General Purpose 2 Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DEBMAJ" edc:nzwidth="0x1" edc:desc="Debouncer Majority Enable"/>
            <edc:SFRFieldDef edc:cname="DEBASYNC" edc:nzwidth="0x1" edc:desc="Debouncer Asynchronous Enable"/>
            <edc:SFRFieldDef edc:cname="RTCOUT" edc:nzwidth="0x1" edc:desc="RTC Output Enable"/>
            <edc:SFRFieldDef edc:cname="DMAEN" edc:nzwidth="0x1" edc:desc="DMA Enable"/>
            <edc:SFRFieldDef edc:cname="DEBF" edc:nzwidth="0x3" edc:desc="Debounce Freqnuency">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_DEB = CLK_RTC/2" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_DEB = CLK_RTC/4" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_DEB = CLK_RTC/8" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_DEB = CLK_RTC/16" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_DEB = CLK_RTC/32" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_DEB = CLK_RTC/64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_DEB = CLK_RTC/128" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_DEB = CLK_RTC/256" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTF" edc:nzwidth="0x3" edc:desc="Active Layer Freqnuency">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_OUT = CLK_RTC/2" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_OUT = CLK_RTC/4" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_OUT = CLK_RTC/8" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_OUT = CLK_RTC/16" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_OUT = CLK_RTC/32" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_OUT = CLK_RTC/64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_OUT = CLK_RTC/128" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_OUT = CLK_RTC/256" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="EVCTRL" edc:nzwidth="0x20" edc:access="---------------nnn----nnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1C3FF" edc:addr="0x40002404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PEREO0" edc:nzwidth="0x1" edc:desc="Periodic Interval 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO1" edc:nzwidth="0x1" edc:desc="Periodic Interval 1 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO2" edc:nzwidth="0x1" edc:desc="Periodic Interval 2 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO3" edc:nzwidth="0x1" edc:desc="Periodic Interval 3 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO4" edc:nzwidth="0x1" edc:desc="Periodic Interval 4 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO5" edc:nzwidth="0x1" edc:desc="Periodic Interval 5 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO6" edc:nzwidth="0x1" edc:desc="Periodic Interval 6 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO7" edc:nzwidth="0x1" edc:desc="Periodic Interval 7 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="ALARMEO0" edc:nzwidth="0x1" edc:desc="Alarm 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="ALARMEO1" edc:nzwidth="0x1" edc:desc="Alarm 1 Event Output Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TAMPEREO" edc:nzwidth="0x1" edc:desc="Tamper Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="OVFEO" edc:nzwidth="0x1" edc:desc="Overflow Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="TAMPEVEI" edc:nzwidth="0x1" edc:desc="Tamper Event Input Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="INTENCLR" edc:nzwidth="0x10" edc:access="nn----nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC3FF" edc:addr="0x40002408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PER0" edc:nzwidth="0x1" edc:desc="Periodic Interval 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PER1" edc:nzwidth="0x1" edc:desc="Periodic Interval 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PER2" edc:nzwidth="0x1" edc:desc="Periodic Interval 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PER3" edc:nzwidth="0x1" edc:desc="Periodic Interval 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PER4" edc:nzwidth="0x1" edc:desc="Periodic Interval 4 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PER5" edc:nzwidth="0x1" edc:desc="Periodic Interval 5 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PER6" edc:nzwidth="0x1" edc:desc="Periodic Interval 6 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PER7" edc:nzwidth="0x1" edc:desc="Periodic Interval 7 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ALARM0" edc:nzwidth="0x1" edc:desc="Alarm 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ALARM1" edc:nzwidth="0x1" edc:desc="Alarm 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Enable"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="nn----nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC3FF" edc:addr="0x4000240A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PER0" edc:nzwidth="0x1" edc:desc="Periodic Interval 0 Enable"/>
            <edc:SFRFieldDef edc:cname="PER1" edc:nzwidth="0x1" edc:desc="Periodic Interval 1 Enable"/>
            <edc:SFRFieldDef edc:cname="PER2" edc:nzwidth="0x1" edc:desc="Periodic Interval 2 Enable"/>
            <edc:SFRFieldDef edc:cname="PER3" edc:nzwidth="0x1" edc:desc="Periodic Interval 3 Enable"/>
            <edc:SFRFieldDef edc:cname="PER4" edc:nzwidth="0x1" edc:desc="Periodic Interval 4 Enable"/>
            <edc:SFRFieldDef edc:cname="PER5" edc:nzwidth="0x1" edc:desc="Periodic Interval 5 Enable"/>
            <edc:SFRFieldDef edc:cname="PER6" edc:nzwidth="0x1" edc:desc="Periodic Interval 6 Enable"/>
            <edc:SFRFieldDef edc:cname="PER7" edc:nzwidth="0x1" edc:desc="Periodic Interval 7 Enable"/>
            <edc:SFRFieldDef edc:cname="ALARM0" edc:nzwidth="0x1" edc:desc="Alarm 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ALARM1" edc:nzwidth="0x1" edc:desc="Alarm 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Enable"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="INTFLAG" edc:nzwidth="0x10" edc:access="nn----nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC3FF" edc:addr="0x4000240C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PER0" edc:nzwidth="0x1" edc:desc="Periodic Interval 0"/>
            <edc:SFRFieldDef edc:cname="PER1" edc:nzwidth="0x1" edc:desc="Periodic Interval 1"/>
            <edc:SFRFieldDef edc:cname="PER2" edc:nzwidth="0x1" edc:desc="Periodic Interval 2"/>
            <edc:SFRFieldDef edc:cname="PER3" edc:nzwidth="0x1" edc:desc="Periodic Interval 3"/>
            <edc:SFRFieldDef edc:cname="PER4" edc:nzwidth="0x1" edc:desc="Periodic Interval 4"/>
            <edc:SFRFieldDef edc:cname="PER5" edc:nzwidth="0x1" edc:desc="Periodic Interval 5"/>
            <edc:SFRFieldDef edc:cname="PER6" edc:nzwidth="0x1" edc:desc="Periodic Interval 6"/>
            <edc:SFRFieldDef edc:cname="PER7" edc:nzwidth="0x1" edc:desc="Periodic Interval 7"/>
            <edc:SFRFieldDef edc:cname="ALARM0" edc:nzwidth="0x1" edc:desc="Alarm 0"/>
            <edc:SFRFieldDef edc:cname="ALARM1" edc:nzwidth="0x1" edc:desc="Alarm 1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------rrrrr--rr----rr-rrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF986F" edc:addr="0x40002410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Bit Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Bit Busy"/>
            <edc:SFRFieldDef edc:cname="FREQCORR" edc:nzwidth="0x1" edc:desc="FREQCORR Register Busy"/>
            <edc:SFRFieldDef edc:cname="CLOCK" edc:nzwidth="0x1" edc:desc="CLOCK Register Busy"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALARM0" edc:nzwidth="0x1" edc:desc="ALARM 0 Register Busy"/>
            <edc:SFRFieldDef edc:cname="ALARM1" edc:nzwidth="0x1" edc:desc="ALARM 1 Register Busy"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MASK0" edc:nzwidth="0x1" edc:desc="MASK 0 Register Busy"/>
            <edc:SFRFieldDef edc:cname="MASK1" edc:nzwidth="0x1" edc:desc="MASK 1 Register Busy"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLOCKSYNC" edc:nzwidth="0x1" edc:desc="Clock Synchronization Enable Bit Busy"/>
            <edc:SFRFieldDef edc:cname="GP0" edc:nzwidth="0x1" edc:desc="General Purpose 0 Register Busy"/>
            <edc:SFRFieldDef edc:cname="GP1" edc:nzwidth="0x1" edc:desc="General Purpose 1 Register Busy"/>
            <edc:SFRFieldDef edc:cname="GP2" edc:nzwidth="0x1" edc:desc="General Purpose 2 Register Busy"/>
            <edc:SFRFieldDef edc:cname="GP3" edc:nzwidth="0x1" edc:desc="General Purpose 3 Register Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="CLOCK" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40002418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SECOND" edc:nzwidth="0x6" edc:desc="Second"/>
            <edc:SFRFieldDef edc:cname="MINUTE" edc:nzwidth="0x6" edc:desc="Minute"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x5" edc:desc="Hour">
              <edc:SFRFieldSemantic edc:cname="AM" edc:desc="AM when CLKREP in 12-hour" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PM" edc:desc="PM when CLKREP in 12-hour" edc:when="(field &amp; 0x1F) == 0x10"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x5" edc:desc="Day"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x4" edc:desc="Month"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x6" edc:desc="Year"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
